{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_section":true,"show_decor":false,"show_content":true,"sec_bg_clr":"#f3f2ec","clr_text":"#333333","banner_bg_clr":"#f0dfd5"}},"about-banner":{"type":"about-banner","settings":{"name":false,"sec_bg_clr":"#f0dfd5","two-sec_bg_clr":"#f3f2ec","clr_text":"#333333","subtitle":"Our story","main-title":"Meet our  Founder, Nikki.","call":"Welcome to My Moonbox","image":"shopify:\/\/shop_images\/About_Us_Hero_1.png","image-mobile":"shopify:\/\/shop_images\/About_Us_-_Hero_Mobile_1.png","video-link":"https:\/\/www.youtube.com\/embed\/0RuJGzrN9gQ","title":"<p>Hey beautiful people!<\/p><p><\/p><p>Welcome to our community!<\/p>","title-mobile":"<p>Hey beautiful people!<\/p><p>Welcome to our community!<\/p>"}},"16491724128ff068a0":{"type":"about-content","settings":{"type":"type-one","sec_bg_clr":"#f2e9e0","clr_text":"#333333","image":"shopify:\/\/shop_images\/IMG_b15b7786-1e6b-4c7a-b30d-929b97d24719.jpg","image-mobile":"shopify:\/\/shop_images\/IMG_04d620bc-6055-48c4-94b0-d89283d620fd.jpg","title":"For 6 years I was unaware of the connection between the ill-health & the pill – until I stopped taking it.","desc":"<p>It was like night and day! My happy go lucky, joyful self returned and the depression lifted BUT this was only the beginning of further health challenges I experienced post pill - which little did I know was to become the start of a healing journey that would lead me to the creation of My Moonbox years later.<\/p><p>After I went off the pill all of my period problems returned, along with hypothyroidism, leaky gut and a period that went MIA for 2 years! I spent thousands of dollars on tests and supplements that only lead me to being presented with the same solution every time: hormonal birth control. But, I intuitively knew there had to be another alternative, a more natural lasting solution to bring me back to health. <\/p><p>This awareness is what finally urged me to take control of my own health. I was done with feeling like crap and suffering on my period every month. So I decided to do a 4 year Nutritional Health science degree! Over that time I discovered the powerful impact food and lifestyle have over our hormones and menstrual health. After making shifts in my own life I was able to bring my body back to health, repair my thyroid, heal my gut and experience periods without the pain and PMS! All without pills and birth control!<\/p><p>It was then I knew that I had to share this essential knowledge with other women and help end unncessary menstrual suffering. <\/p>"}},"1649235630f018bf9a":{"type":"appeal","blocks":{"84a26e44-3168-4413-a11a-dc32644457f4":{"type":"text","settings":{"item":"Settle for cramps and mood swings every month"}},"7c8c547f-d79d-4625-aac1-47b3485a9f60":{"type":"text","settings":{"item":"Accept breakouts, breast tenderness, heavy periods, bloating or any symptom as an unavoidable part of your cycle"}},"eaaee771-c38b-4dab-9ba5-ff80464c6002":{"type":"text","settings":{"item":"Settle for anything less than easy, comfortable periods!"}}},"block_order":["84a26e44-3168-4413-a11a-dc32644457f4","7c8c547f-d79d-4625-aac1-47b3485a9f60","eaaee771-c38b-4dab-9ba5-ff80464c6002"],"settings":{"type":"type-two","bord":true,"additional":true,"sec_bg_clr":"#f3f2ec","clr_text":"#333333","subtitle":"","title":"Today I can confidently say that menstrual suffering is not my fate. And guess what? It’s not yours either.","appeal_text":"","btn":"","btn_url":"","additional-title":"It is our responsibility to take charge of our health and learn about our bodies & cycles in a more empowering & intimate way.","additional-text":"<p>Of course in some cases medical intervention is absolutely necessary, however we are also doing ourselves a disservice when common go-to solutions disconnect us from our bodies and prevent us from experiencing the benefits that can come with a naturally healthy cycle: optimal energy, fertility, libido, metabolism, stamina, happiness and vitality!<\/p>","benefits-title":"YOU DON'T NEED TO"}},"1649234381ee3a45a7":{"type":"about-content","settings":{"type":"type-two","sec_bg_clr":"#f2e9e0","clr_text":"#333333","image":"shopify:\/\/shop_images\/About_Us_1.0.png","title":"Your period symptoms are not “normal”.","desc":"<p>Period pain, mood swings, acne, hair loss, tender breasts, fatigue, low energy…<\/p><p>These monthly symptoms are not a necessary or “normal” or inevitable part of your cycle.<\/p><p>Instead they are your body’s way of communicating an underlying hormone imbalance that needs to be addressed.<\/p><p>It’s time to listen. <\/p>"}},"1649234419b18ef8b1":{"type":"about-content","settings":{"type":"type-three","sec_bg_clr":"#f3f2ec","clr_text":"#333333","image":"shopify:\/\/shop_images\/About_Us_2.0.png","title":"Hormones shouldn’t be confusing or complicated.","desc":"<p>You shouldn’t have to go to university for 4 years to get a degree on your body & hormones.<\/p><p>At My Moonbox we’ve done the work for you, created the products your hormones need and compiled all of the essential cycle knowledge into our Masterclass, e-books & courses so that you’re provided with everything we all should have been taught since we got our first periods! <\/p>"}},"16492344268c8a3b48":{"type":"about-content","settings":{"type":"type-four","sec_bg_clr":"#f2e9e0","clr_text":"#333333","image":"shopify:\/\/shop_images\/IMGd.jpg","image-mobile":"shopify:\/\/shop_images\/IMG_c3e0d28e-cdf9-4a80-b585-66f2f77a3199.jpg","title":"You don’t have to feel alone, overwhelmed or unheard on this journey.","desc":"<p>Sick of leaving the doctors office feeling unheard? Or have your test results come back normal even though you know something isn’t right…Maybe the doctor dismisses your concerns as “normal”?<\/p><p>At My Moonbox we believe no woman should ever have to feel alone on their health journey which is why we have our online community where you can connect with 1000s of like minded women and our team of naturopaths! We are passionate about empowering you with the education & support that puts YOU in the driver’s seat. Because we have so much more control over our hormones than we are ever told.<\/p>"}},"1649235709a8d7b076":{"type":"appeal","settings":{"type":"type-three","bord":false,"additional":false,"sec_bg_clr":"#f3f2ec","clr_text":"#333333","subtitle":"","title":"It's about changing your period story","appeal_text":"<p>Everybody’s periods are different. There’s no ‘one right way’ to period. At My Moonbox we’re not here to tell you what your journey should look like. We’re here to empower you with everything you need to discover a new relationship with your period & support your body back to balance so that you can become the happiest, healthiest & most confident version of yourself throughout your entire cycle.<\/p>","btn":"Start your journey today","btn_url":"shopify:\/\/collections","additional-title":"","additional-text":"","benefits-title":""}}},"order":["main","about-banner","16491724128ff068a0","1649235630f018bf9a","1649234381ee3a45a7","1649234419b18ef8b1","16492344268c8a3b48","1649235709a8d7b076"]}